cmsis-svd/cmsis-svd/data/Microchip/ATSAMD21JxA.svd
        <register>
          <name>INTFLAG</name>
          <description>DEVICE Device Interrupt Flag</description>
          <addressOffset>0x01C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>SUSPEND</name>
              <description>Suspend</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MSOF</name>
              <description>Micro Start of Frame in High Speed Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SOF</name>
              <description>Start Of Frame</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORST</name>
              <description>End of Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAKEUP</name>
              <description>Wake Up</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EORSM</name>
              <description>End Of Resume</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>UPRSM</name>
              <description>Upstream Resume</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMACER</name>
              <description>Ram Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMNYET</name>
              <description>Link Power Management Not Yet</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMSUSP</name>
              <description>Link Power Management Suspend</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EPINTSMRY</name>
          <description>DEVICE End Point Interrupt Summary</description>
          <addressOffset>0x020</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EPINT0</name>
              <description>End Point 0 Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT1</name>
              <description>End Point 1 Interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT2</name>
              <description>End Point 2 Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT3</name>
              <description>End Point 3 Interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT4</name>
              <description>End Point 4 Interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT5</name>
              <description>End Point 5 Interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT6</name>
              <description>End Point 6 Interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EPINT7</name>
              <description>End Point 7 Interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESCADD</name>
          <description>Descriptor Address</description>
          <addressOffset>0x024</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DESCADD</name>
              <description>Descriptor Address Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PADCAL</name>
          <description>USB PAD Calibration</description>
          <addressOffset>0x028</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>TRANSP</name>
              <description>USB Pad Transp calibration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRANSN</name>
              <description>USB Pad Transn calibration</description>
              <bitOffset>6</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TRIM</name>
              <description>USB Pad Trim calibration</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPCFG%s</name>
          <description>DEVICE End Point Configuration</description>
          <addressOffset>0x100</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EPTYPE0</name>
              <description>End Point Type0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>EPTYPE1</name>
              <description>End Point Type1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>NYETDIS</name>
              <description>NYET Token Disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPSTATUSCLR%s</name>
          <description>DEVICE End Point Pipe Status Clear</description>
          <addressOffset>0x104</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTGLOUT</name>
              <description>Data Toggle OUT Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTGLIN</name>
              <description>Data Toggle IN Clear</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Curren Bank Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLRQ0</name>
              <description>Stall 0 Request Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLRQ1</name>
              <description>Stall 1 Request Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 Ready Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 Ready Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPSTATUSSET%s</name>
          <description>DEVICE End Point Pipe Status Set</description>
          <addressOffset>0x105</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DTGLOUT</name>
              <description>Data Toggle OUT Set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>DTGLIN</name>
              <description>Data Toggle IN Set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Current Bank Set</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLRQ0</name>
              <description>Stall 0 Request Set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALLRQ1</name>
              <description>Stall 1 Request Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 Ready Set</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 Ready Set</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPSTATUS%s</name>
          <description>DEVICE End Point Pipe Status</description>
          <addressOffset>0x106</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>DTGLOUT</name>
              <description>Data Toggle Out</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DTGLIN</name>
              <description>Data Toggle In</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURBK</name>
              <description>Current Bank</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLRQ0</name>
              <description>Stall 0 Request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALLRQ1</name>
              <description>Stall 1 Request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BK0RDY</name>
              <description>Bank 0 ready</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BK1RDY</name>
              <description>Bank 1 ready</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPINTFLAG%s</name>
          <description>DEVICE End Point Interrupt Flag</description>
          <addressOffset>0x107</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL0</name>
              <description>Error Flow 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL1</name>
              <description>Error Flow 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTP</name>
              <description>Received Setup</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL0</name>
              <description>Stall 0 In/out</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL1</name>
              <description>Stall 1 In/out</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPINTENCLR%s</name>
          <description>DEVICE End Point Interrupt Clear Flag</description>
          <addressOffset>0x108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0 Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1 Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL0</name>
              <description>Error Flow 0 Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL1</name>
              <description>Error Flow 1 Interrupt Disable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTP</name>
              <description>Received Setup Interrupt Disable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL0</name>
              <description>Stall 0 In/Out Interrupt Disable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL1</name>
              <description>Stall 1 In/Out Interrupt Disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>EPINTENSET%s</name>
          <description>DEVICE End Point Interrupt Set Flag</description>
          <addressOffset>0x109</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TRCPT0</name>
              <description>Transfer Complete 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRCPT1</name>
              <description>Transfer Complete 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL0</name>
              <description>Error Flow 0 Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRFAIL1</name>
              <description>Error Flow 1 Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXSTP</name>
              <description>Received Setup Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL0</name>
              <description>Stall 0 In/out Interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STALL1</name>
              <description>Stall 1 In/out Interrupt enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
